posts/2017-05-16-prayer-for-finals-week.org
#+date: <2017-05-16>
#+filetags: prayer religion
#+title: Prayer for Finals Week

It is finals week here at Oklahoma Baptist University. Here is a prayer for students:

Dear students,

May God calm your anxieties,\\
refresh your minds,\\
and honor the faithfulness\\
you have shown this semester.

Remember that God has gifted you\\
more than you can imagine,\\
and you are capable of more\\
than you've ever dreamed.

May the great wisdom of the Father,\\
the incomparable love of the Son,\\
and the mighty power of the Spirit\\
be with you all this week.

/Amen/


#+begin_tagline
Tagged: [[file:../tags/prayer.org][Prayer]] [[file:../tags/religion.org][Religion]]
#+end_tagline
