docs/posts/2017-05-16-prayer-for-finals-week.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Jan 07, 2025 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Prayer for Finals Week</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Prayer for Finals Week</h1>
<p class="subtitle" role="doc-subtitle">May 16, 2017</p>
</header><p>
It is finals week here at Oklahoma Baptist University. Here is a prayer for students:
</p>

<p>
Dear students,
</p>

<p>
May God calm your anxieties,<br>
refresh your minds,<br>
and honor the faithfulness<br>
you have shown this semester.
</p>

<p>
Remember that God has gifted you<br>
more than you can imagine,<br>
and you are capable of more<br>
than you&rsquo;ve ever dreamed.
</p>

<p>
May the great wisdom of the Father,<br>
the incomparable love of the Son,<br>
and the mighty power of the Spirit<br>
be with you all this week.
</p>

<p>
<i>Amen</i>
</p>


<div class="tagline" id="org9644d8e">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a> <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jan 07, 2025.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
